In [22]:
import pandas as pd
from sqlalchemy import create_engine

In [1]:
%load_ext sql

In [20]:
%sql postgresql://postgres:nubank@127.0.0.1/nubank

In [84]:
unir = pd.read_sql('''SELECT account_id, amount, 'ENTRADA' AS tipo
                            FROM transfer_ins_table

                            UNION ALL

                            SELECT account_id, -amount, 'SAIDA' AS tipo
                            FROM transfer_outs_table

                            UNION ALL 

                            SELECT account_id, CASE in_or_out WHEN 'pix_out' then -pix_amount ELSE pix_amount END,
                             CASE in_or_out WHEN 'pix_out' then 'PIX SAIDA' ELSE 'PIX ENTRADA' END as tipo
                            FROM pix_movements_table as p
                            ORDER BY account_id
                            
                            ''', engine)

In [85]:
unir.head()

         account_id   amount     tipo
0  2569200459575096   766.56  ENTRADA
1  2569200459575096   747.10  ENTRADA
2  2569200459575096  1617.12  ENTRADA
3  2569200459575096  1040.63  ENTRADA
4  2569200459575096   944.22  ENTRADA

In [86]:
tmp_df = "./tables/tables/balance_new.csv"
unir.to_csv(tmp_df,index=False)

In [64]:
%%sql

SELECT mes, account_id, ROUND(CAST(sum(entrada) AS NUMERIC),2) AS entradas_total, ROUND(CAST(SUM(saida) AS NUMERIC),2) as saidas_total, ROUND(CAST((sum(entrada) - SUM(saida))AS NUMERIC),2) as balanco
FROM (SELECT account_id, CASE in_or_out WHEN 'pix_out' then pix_amount ELSE 0 END as SAIDA, 
CASE in_or_out WHEN  'pix_in' then pix_amount ELSE 0 END as ENTRADA, 'PIX' AS tipo,
to_timestamp(CAST(pix_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(pix_completed_at as numeric)/1000)) MES
FROM pix_movements_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000))  = 2020)

UNION ALL

SELECT account_id, 0 AS SAIDA, 
amount as ENTRADA, 'ENTRADA' AS tipo, to_timestamp(CAST(transaction_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
FROM transfer_ins_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)

UNION ALL

SELECT account_id, amount as SAIDA, 0 AS ENTRADA, 'SAIDA' AS tipo, to_timestamp(CAST(transaction_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
FROM transfer_outs_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)) as transac
GROUP BY mes, account_id
ORDER BY account_id, mes
LIMIT 12

 * postgresql://postgres:***@127.0.0.1/nubank
12 rows affected.

[(1.0, 2569200459575096, Decimal('6622.15'), Decimal('1826.30'), Decimal('4795.85')),
 (2.0, 2569200459575096, Decimal('2510.59'), Decimal('4934.91'), Decimal('-2424.32')),
 (3.0, 2569200459575096, Decimal('2221.55'), Decimal('3205.17'), Decimal('-983.62')),
 (4.0, 2569200459575096, Decimal('4492.74'), Decimal('540.40'), Decimal('3952.34')),
 (5.0, 2569200459575096, Decimal('1825.52'), Decimal('2429.55'), Decimal('-604.03')),
 (6.0, 2569200459575096, Decimal('2322.68'), Decimal('3059.74'), Decimal('-737.06')),
 (7.0, 2569200459575096, Decimal('3003.19'), Decimal('8062.59'), Decimal('-5059.40')),
 (8.0, 2569200459575096, Decimal('80.60'), Decimal('2333.27'), Decimal('-2252.67')),
 (9.0, 2569200459575096, Decimal('2401.67'), Decimal('3796.14'), Decimal('-1394.47')),
 (10.0, 2569200459575096, Decimal('1542.31'), Decimal('457.52'), Decimal('1084.79')),
 (11.0, 2569200459575096, Decimal('253.42'), Decimal('5605.24'), Decimal('-5351.82')),
 (12.0, 2569200459575096, Decimal('7881.35'), Decimal('3179.07'), Decimal('4702.28'))]

In [65]:
# Format
engine = create_engine('postgresql://postgres:nubank@127.0.0.1/nubank')

In [61]:
balance = pd.read_sql('''
SELECT mes, account_id, ROUND(CAST(sum(entrada) AS NUMERIC),2) AS entradas_total, ROUND(CAST(SUM(saida) AS NUMERIC),2) as saidas_total, ROUND(CAST((sum(entrada) - SUM(saida))AS NUMERIC),2) as balanco
FROM (SELECT account_id, CASE in_or_out WHEN 'pix_out' then pix_amount ELSE 0 END as SAIDA, 
CASE in_or_out WHEN  'pix_in' then pix_amount ELSE 0 END as ENTRADA, 'PIX' AS tipo,
to_timestamp(CAST(pix_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(pix_completed_at as numeric)/1000)) MES
FROM pix_movements_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000))  = 2020)

UNION ALL

SELECT account_id, 0 AS SAIDA, 
amount as ENTRADA, 'ENTRADA' AS tipo, to_timestamp(CAST(transaction_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
FROM transfer_ins_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)

UNION ALL

SELECT account_id, amount as SAIDA, 0 AS ENTRADA, 'SAIDA' AS tipo, to_timestamp(CAST(transaction_completed_at as numeric)/1000) AS data,
DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) ANO,
DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
FROM transfer_outs_table
WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)) as transac
GROUP BY mes, account_id
ORDER BY account_id, mes
''', engine)

In [60]:
balance.head()

   mes        account_id  entradas_total  saidas_total  balanco
0  1.0  2569200459575096         6622.15       1826.30  4795.85
1  2.0  2569200459575096         2510.59       4934.91 -2424.32
2  3.0  2569200459575096         2221.55       3205.17  -983.62
3  4.0  2569200459575096         4492.74        540.40  3952.34
4  5.0  2569200459575096         1825.52       2429.55  -604.03

In [62]:
tmp_df = "./tables/tables/balance.csv"
balance.to_csv(tmp_df,index=False)